src_doc/InformationRegisters/ТаймлистФайлыВОбработке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймлистФайлыВОбработке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТаймлистТипыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ТаймлистФайлыВОбработке/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет файл в очередь обработки.
// 
// Параметры:
//  ВерсияФайла - СправочникСсылка.ВерсииФайлов
//  Задание - ПеречислениеСсылка.ТаймлистТипыЗаданий
//  Параметры - Структура
// 
Процедура Добавить(ВерсияФайла, Задание, Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВерсияФайла = ВерсияФайла;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ВерсияФайла = ВерсияФайла;
		Если Параметры <> Неопределено Тогда
			МенеджерЗаписи.Параметры = Новый ХранилищеЗначения(Параметры);
		КонецЕсли;
	Иначе
		Если Параметры <> Неопределено Тогда
			ТекущиеПараметры = МенеджерЗаписи.Параметры.Получить();
			Если ТекущиеПараметры <> Неопределено Тогда
				Для Каждого Параметр Из Параметры Цикл
					ТекущиеПараметры.Вставить(Параметр.Ключ, Параметр.Значение);
				КонецЦикла;
			Иначе
				ТекущиеПараметры = Параметры;
			КонецЕсли;
			МенеджерЗаписи.Параметры = Новый ХранилищеЗначения(ТекущиеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Задание = Задание;
	Если Задание = Перечисления.ТаймлистТипыЗаданий.ЗагрузитьФайлВСервис
		Или Задание = Перечисления.ТаймлистТипыЗаданий.ПодготовитьДанныеКПолучениюАвтопротокола Тогда
		МенеджерЗаписи.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Удаляет файл из очереди обработки.
// 
// Параметры:
//  ВерсияФайла - СправочникСсылка.ВерсииФайлов
// 
Процедура Удалить(ВерсияФайла) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВерсияФайла = ВерсияФайла;
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

// Возвращает автора задания на получение расшифровки и автопротокола.
// 
// Параметры:
//  ВерсияФайла - СправочникСсылка.ВерсииФайлов
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи
//
Функция АвторЗадания(ВерсияФайла) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВерсияФайла = ВерсияФайла;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.Автор;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
